Revit 2027 API
BuiltInFailures.ReshapeFromFacetsFailures Class
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.ReshapeFromFacetsFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class ReshapeFromFacetsFailures
Public NotInheritable Class ReshapeFromFacetsFailures
public ref class ReshapeFromFacetsFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ReshapeFromFacetsFailures = class end
The BuiltInFailures.ReshapeFromFacetsFailures type exposes the following members.
Properties
Name | Description
ReshapeFromFacetsFailed |  Reshape from facets failed. [Description]
ReshapeFromFacetsFailedError |  Reshape from facets failed. [Description]
Top
See Also
Reference
Autodesk.Revit.DB Namespace